app/controllers/stuffs_controller.rb

SELECT * FROM "stuffs"
---
  def index
    @stuffs = Stuff.all

SELECT * FROM "stuffs" WHERE ("stuffs"."id" = 1)
---
  def show
    @stuff = Stuff.find(params[:id])

SELECT * FROM "stuffs" WHERE ("stuffs"."id" = 1)
---
  def edit
    @stuff = Stuff.find(params[:id])

SELECT * FROM "stuffs" WHERE ("stuffs"."id" = 1)
UPDATE "stuffs" SET "updated_at" = '2010-04-04 14:40:25', "title" = 'Hello', "description" = 'Test Description' WHERE "id" = 1
---
  def update
    @stuff = Stuff.find(params[:id])

    respond_to do |format|
      if @stuff.update_attributes(params[:stuff])